content/post/Anchor-links-not-working-in-hugo.org
#+author: Trevor Wilson
#+email: trevor.wilson@bloggerbust.ca
#+title: "Anchor links not working in hugo"
#+date: 2018-06-20T07:09:19-06:00
#+startup: showeverything

* What is the issue
If I create a link to a local heading [[#footnotes][a header link]], the browser renders the link relative to the webroot. If you click on the link it will navigate the browser to the webroot and query for the anchor from that location rather than the current document. The same issue happens when tring to link to a footnote [fn:1].

* Footnotes
:PROPERTIES:
:COLUMNS:  %CUSTOM_ID[(Custom Id)]
:CUSTOM_ID: footnotes
:END:

[fn:1] this is a footnote.


